Repository: oblalex/horus
Catalog: commander/l10n/*.po
Languages: ru

source: Console parser initialization
ru: Инициализация разборщика сообщений консоли сервера

source: Console parser tearing down
ru: Остановка разборщика сообщений консоли сервера

source: Setting up signal hooks
ru: Установка обработчиков сигналов

source: Signal caugth
ru: Получен сигнал

source: Game server is shut down
ru: Игровой сервер остановлен

source: Restarting game server in
ru: Перезапуск игрового сервера через

source: Waiting for server is loaded
ru: Ожидание загрузки сервера

source: Game server loading timeout
ru: Превышено время ожидания загрузки сервера

source: Checking server's configuration
ru: Проверка конфигурации сервера

source: Loading configuration
ru: Загрузка конфигурации

source: Saving configuration
ru: Сохранение конфигурации

source: Suppressing logging to chat
ru: Подавление вывода журнала в чат

source: Disabling saving console output to file
ru: Отключение сохранения вывода консоли в файл

source: Setting logging output file
ru: Установка выходного файла журнала

source: Enabling log resetting for every mission
ru: Включение сброса журнала перед каждой миссией

source: Enabling buildings destruction logging
ru: Включение журналирования разрушений зданий

source: Enabling server's console
ru: Bключение консоли сервера

source: Setting console allowed clients list
ru: Установление списка разрешенных клиентов консоли

source: Setting client version checking
ru: Установление проверки совместимости версий

source: Hello, %s! Welcome to '%s' server!
ru: Здравия желаем, товарищ %s! Добро пожаловать на сервер '%s'!

source: Server is under Horus Commander control (v.%s, oblalex.github.com/horus).
ru: Сервер управляется Хорус Коммандером (v.%s, oblalex.github.com/horus).

source: Kicking all!
ru: Удаление всех пользователей!

source: Initializing console socket
ru: Инициализация сокета консоли

source: Socket not created
ru: Сокет не был создан

source: Connection failed
ru: Не удалось соединиться

source: Select failed
ru: Не удалось выполнить select

source: Cannot make non-blocking
ru: Невозможно сделать сокет неблокирующим

source: Server's supposed IP
ru: Предполагаемый IP сервера

source: WSAHtons call failed
ru: Вызов WSAHtons не удался

source: Closing console socket
ru: Закрытие сокета консоли

source: Starting console and shell handling threads
ru: Запуск потоков обработки вывода сервера и пользовательского ввода

source: Game server's output processing started
ru: Обработка вывода сервера начата

source: Game server's output processing finished
ru: Обработка вывода сервера завершена

source: User's shell activated
ru: Пользовательский ввод доступен

source: User's shell deactivated
ru: Пользовательский ввод недоступен

source: Stopping console and shell handling threads
ru: Остановка потоков обработки вывода сервера и пользовательского ввода

source: Loading missions list
ru: Загрузка списка миссий

source: XML document is invalid
ru: Некоректный XML документ

source: name is not set. Skipping
ru: отсутствует название. Пропускаем

source: Name already exists in list. Skipping
ru: Имя уже сужествует в списке. Пропускаем

source: path is not set. Skipping
ru: не указан путь. Пропускаем

source: duration is not set. Using default value
ru: длительность не указана. Используем значение по умолчанию

source: Only one mission can be current. Changing
ru: Только одна миссия может быть текущей. Замена

source: Missions list is empty
ru: Список миссий пуст

source: Missions:
ru: Миссии:

source: has no references. Deleting
ru: не имеет ссылок на себя. Удаляем

source: has no next missions. This may cause playing mission list only once
ru: не имеет следующих миссий. Это может вызвать проигрывание списка миссий только один раз

source: setting next BLUE map equal to next NONE map
ru: установка следующей СИНЕЙ карты равной следующей НИЧЬЕЙ карте

source: setting next RED map equal to next NONE map
ru: установка следующей КРАСНОЙ карты равной следующей НИЧЬЕЙ карте

source: setting next RED and BLUE maps equal to next NONE map
ru: установка следующих КРАСНОЙ и СИНЕЙ карт равными следующей НИЧЬЕЙ карте

source: setting next BLUE and NONE maps equal to next RED map
ru: установка следующих СИНЕЙ и НИЧЬЕЙ карт равными следующей КРАСНОЙ карте

source: setting next RED and NONE maps equal to next BLUE map
ru: установка следующих КРАСНОЙ и НИЧЬЕЙ карт равными следующей СИНЕЙ карте

source: setting next NONE map equal to next RED map
ru: установка следующей НИЧЬЕЙ карты равной следующей КРАСНОЙ карте

source: Saving missions list
ru: Сохранение списка миссий

source: Clearing missions list
ru: Очистка списка миссий

source: Mission is already loaded
ru: Миссия уже загружена

source: Loading mission
ru: Загрузка миссии

source: Mission loading failed.
ru: Загрузка миссии не удалась.

source: Mission loaded.
ru: Миссия загружена.

source: Current mission is not selected
ru: Текущая миссия не выбрана

source: Mission loading timeout
ru: Превышено время ожидания загрузки миссии

source: Mission is not loaded
ru: Миссия не загружена

source: Mission is still running
ru: Миссия все ещё запущена

source: Unloading mission...
ru: Выгрузка миссии...

source: Mission unloading timeout
ru: Превышено время ожидания выгрузки миссии

source: Mission unloaded.
ru: Миссиия выгружена.

source: Mission unloading failed.
ru: Выгрузить миссию не удалось.

source: Mission is already running
ru: Миссия все ещё запущена

source: Launching mission
ru: Запуск миссии...

source: Mission launching failed.
ru: Запуск миссии не удался.

source: Mission launched.
ru: Миссия запущена.

source: Mission launching timeout
ru: Превышено время ожидания запуска миссии

source: Mission is not running
ru: Миссия не запущена

source: Ending mission...
ru: Завершение миссии...

source: Mission ending timeout
ru: Превышено время ожидания завершения миссии

source: Mission ending failed.
ru: Завершить мисиию не удалось.

source: Re-running mission
ru: Быстрый перезапуск миссии

source: Going to next mission
ru: Переход к следующей миссии

source: Going to previous mission
ru: Переход к предыдущей миссии

source: Previous mission is not selected
ru: Предыдущая миссиия не выбрана

source: Starting mission
ru: Старт миссии

source: Stopping mission
ru: Остановка миссии

source: Re-starting mission
ru: Полный перезапуск миссии

source: Initializing mission manager
ru: Инициализация менеджера миссий

source: Releasing mission manager
ru: Завершение работы менеджера миссий

source: Mission ended.
ru: Миссия завершена.

source: Mission was interrupted.
ru: Миссия была прервана.

source: Mission time left
ru: Оставшееся время миссии

source: Events parsing started
ru: Обработка событий карты начата

source: Events parsing stopped
ru: Обработка событий карты завершена

source: Checking root path
ru: Проверка корневого пути

source: Please, make sure in following:
ru: Пожалуйста, убедитесь в следующем:

source: 1. This program is located in IL-2 server's subdirectory.
ru: 1. Данная программма размещена в поддиректории сервера ИЛ-2.

source: 2. You are located at that directory currently.
ru: 2. Вы находитесь в этой поддиректории в данный момент.

source: 3. IL-2 server's executable file is named as
ru: 3. Испольняемый файл сервера ИЛ-2 называется

source: Checking logs path
ru: Проверка пути к журналам

source: Creating missing directory
ru: Создание отсутствующей директории

source: Failed to create
ru: Не удалось создать

source: Checking missions list path
ru: Проверка пути списка миссиий

source: Missions list was not found. Please, read the manual about missions managing.
ru: Список миссий не найден. Пожалуйста, обратитесь к руководству по управлению миссиями

source: Mission's path is wrong:
ru: Неверный путь к миссии:

source: Creating game server process
ru: Создание процесса игрового сервера

source: StdoutRd CreatePipe
ru: Не удалось вызвать CreatePipe для StdoutRd

source: Stdout SetHandleInformation
ru: Не удалось вызвать SetHandleInformation для Stdout

source: Failed to fork
ru: Не удалось выполнить форк

source: Game server's process finished
ru: Процесс игрового сервера завершен

source: Generating server's scripts
ru: Создание скриптов для сервера

source: Generating garbage collecting script
ru: Создание скрипта сборки мусора

source: Generating main script
ru: Создание главного скрипта

source: Unable to create file
ru: Невозможно создать файл

source: "IL-2 Sturmovik: Fogotten Battles" server control and statistics collecting subsystem of "Horus"
ru: Сбор статистики и управление сервером "ИЛ-2 Штурмовик: Забытые Сражения". Часть системы "Хорус"

source: Usage
ru: Использование

source: Arguments
ru: Аргументы

source: Print this help
ru: Вывести эту справку

source: Print program version
ru: Вывести версию программы

source: Send bug reports to
ru: Сообщайте об ошибках здесь

source: More information at
ru: Получите больше информации здесь

source: Argument unknown
ru: Неизвестный аргумент

source: Pilot manager initialization
ru: Инициализация менеджера пилотов

source: Pilot manager tearing down
ru: Остановка менеджера пилотов

source: %s (%s) joined.
ru: %s (%s) присоединился.

source: %s has left.
ru: %s покинул сервер.

source: Shell parser initialization
ru: Инициализация разборщика пользовательского ввода

source: Shell parser tearing down
ru: Остановка разборщика пользовательского ввода

source: Unknown command.
ru: Неизвестная комманда.

source: Unable to parse ini-file
ru: Невозможна обработка ini-файла

source: Unable to open ini-file
ru: Невозможно открытие ini-файла

source: Can not allocate memory for ini-record
ru: Недостаточно памяти для ini-записи

source: Can not allocate memory for ini-section
ru: Недостаточно памяти для ini-секции

source: Can not allocate memory for ini-container
ru: Недостаточно памяти для ini-контейнера

source: BUSY
ru: ЗАНЯТ

source: DONE
ru: ГОТОВ

source: FAIL
ru: ОШИБК
